The current document.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public Document Document { get; }
  Visual Basic
Public ReadOnly Property Document As Document
	Get
  Visual C++
public:
property Document^ Document {
	Document^ get ();
}
 See Also
  MemberForcesServiceData Class
  Autodesk.Revit.DB.Structure Namespace